## 1. pandas 패키지 로드

In [0]:
import pandas

### 별칭은 주로 pd로 사용합니다.

In [0]:
# 코드를 입력해 주세요

In [0]:
pd

## 2. pandas 의 Series 와 DataFrame

1차원, 1개의 column은 Series라고 합니다.

### 2-1. Series

In [0]:
# 코드를 입력해 주세요

0    1
1    2
2    3
3    4
dtype: int64

In [0]:
a = [1, 2, 3, 4]

In [0]:
# 코드를 입력해 주세요

0    1
1    2
2    3
3    4
dtype: int64

In [0]:
mylist = [1, 2, 3, 4]
# 코드를 입력해 주세요

0    1
1    2
2    3
3    4
dtype: int64

### 2-2. DataFrame

#### 방법 1. list로 만들기

In [0]:
company1 = [['삼성', 2000, '스마트폰'],
           ['현대', 1000, '자동차'],
           ['네이버', 500, '포털']]

In [0]:
# 코드를 입력해 주세요

     0     1     2
0   삼성  2000  스마트폰
1   현대  1000   자동차
2  네이버   500    포털

In [0]:
df1 = # 코드를 입력해 주세요

In [0]:
df1

     0     1     2
0   삼성  2000  스마트폰
1   현대  1000   자동차
2  네이버   500    포털

#### 제목컬럼 만들기

In [0]:
df1.columns = # 코드를 입력해 주세요

In [0]:
df1

   기업명   매출액    업종
0   삼성  2000  스마트폰
1   현대  1000   자동차
2  네이버   500    포털

#### 방법 2. dict로 만들기

In [0]:
company2 = {'기업명':['삼성', '현대', '네이버'], 
            '매출액': [2000, 1000, 500], 
            '업종': ['스마트폰', '자동차', '포털']
           }

In [0]:
df2 = # 코드를 입력해 주세요

In [0]:
df2

   기업명   매출액    업종
0   삼성  2000  스마트폰
1   현대  1000   자동차
2  네이버   500    포털

#### index를 특정 column으로 지정하기

In [0]:
df1

   기업명   매출액    업종
0   삼성  2000  스마트폰
1   현대  1000   자동차
2  네이버   500    포털

In [0]:
df1.index = # 코드를 입력해 주세요

In [0]:
df1

     기업명   매출액    업종
기업명
삼성    삼성  2000  스마트폰
현대    현대  1000   자동차
네이버  네이버   500    포털

#### series = column 이라고 하였습니다. 확인해 볼까요?

In [0]:
df1['매출액']

기업명
삼성     2000
현대     1000
네이버     500
Name: 매출액, dtype: int64

In [0]:
type(df1['매출액'])

pandas.core.series.Series